app/Http/Controllers/IndexController.php

    public function index ()
    {

        $sliders = Slider::query()
                ->where('status', 1)
                ->orderBy('priority')
                ->get();

        $postsQuery = Post::query()
                ->with(['user', 'postCategory'])
                ->where('status', 1)
                ;

        $posts = $postsQuery
                ->where('important', 1)
                ->orderBy('created_at', 'desc')
                ->limit(3)
                ->get()
                ;


        $latestPosts = $postsQuery
                ->orderBy('created_at', 'desc')
                ->limit(12)
                ->get()
---
select * from `sliders` where `status` = 1 order by `priority` asc
select * from `post_categories` where `post_categories`.`id` in (1, 2, 4)
select * from `posts` where `important` = 1 order by `created_at` desc limit 3
select * from `users` where `users`.`id` in (2, 3)
select * from `post_categories` where `post_categories`.`id` in (1, 2, 3, 4, 6)
select * from `posts` where `important` = 1 order by `created_at` desc, `created_at` desc limit 12
select * from `users` where `users`.`id` in (1, 2, 3)