app/Http/Controllers/PostsController.php

select * from `post_categories` where `post_categories`.`id` in (1, 2, 3, 4, 6)
select * from `posts` order by `created_at` desc limit 12 offset 0
select * from `users` where `users`.`id` in (1, 2, 3)
select count(*) as aggregate from `posts`
select * from `post_categories` where `post_categories`.`id` in (1, 2, 3, 4, 5, 6)
select * from `posts` order by `created_at` asc limit 3
select `tags`.*, (select count(*) from `posts` inner join `post_tags` on `posts`.`id` = `post_tags`.`post_id` where `tags`.`id` = `post_tags`.`tag_id`) as `posts_count` from `tags` order by `posts_count` desc
---
    public function index (Request $request)
    {


        $posts = Post::query()
                ->with('postCategory', 'user')
                ->orderBy('created_at', 'desc')
                ->paginate(12)
                ;

        $latestPosts = Post::query()
                    ->orderBy('created_at')
                    ->limit(3)
                    ->get()
                    ;

        $postCategories = PostCategory::query()
                ->orderBy('priority')
                ->withCount(['posts'])
                ->get()
                ;

        $allTags = Tag::query()
                ->withCount('posts')
                ->orderBy('posts_count', 'desc')
                ->get()

select * from `post_categories` where `post_categories`.`id` in (4)
select * from `posts` where `post_category_id` = 4 order by `created_at` desc limit 12 offset 0
select * from `users` where `users`.`id` in (1, 2, 3)
select count(*) as aggregate from `posts` where `post_category_id` = 4
select * from `posts` order by `created_at` asc limit 3
select * from `post_categories` where `post_categories`.`id` in (1, 2, 3, 4, 5, 6)
select * from `users` where `users`.`id` in (2)
select `tags`.*, (select count(*) from `posts` inner join `post_tags` on `posts`.`id` = `post_tags`.`post_id` where `tags`.`id` = `post_tags`.`tag_id`) as `posts_count` from `tags` order by `posts_count` desc
select count(*) as aggregate from `posts` where `user_id` = 2
---
    public function categoryPosts (Request $request, PostCategory $postCategory)
    {
        $posts = Post::query()
                ->where('post_category_id', $postCategory->id)
                ->with(['postCategory', 'user'])
                ->orderBy('created_at', 'desc')
                ->paginate(12)
                ;

        $postCategories = PostCategory::query()
                ->orderBy('priority')
                ->withCount(['posts'])
                ->get()
                ;

        $latestPosts = Post::query()
                ->orderBy('created_at')
                ->limit(3)
                ->get()
                ;


        $allTags = Tag::query()
                ->withCount('posts')
                ->orderBy('posts_count', 'desc')
                ->get()

select * from `post_categories` where `post_categories`.`id` in (1, 2, 3, 4)
select * from `posts` where exists (select * from `tags` inner join `post_tags` on `tags`.`id` = `post_tags`.`tag_id` where `posts`.`id` = `post_tags`.`post_id` and `tag_id` = 2) order by `created_at` asc limit 12 offset 0
select * from `users` where `users`.`id` in (1, 2, 3)
select count(*) as aggregate from `posts` where exists (select * from `tags` inner join `post_tags` on `tags`.`id` = `post_tags`.`tag_id` where `posts`.`id` = `post_tags`.`post_id` and `tag_id` = 2)
select `posts`.*, `post_tags`.`tag_id` as `pivot_tag_id`, `post_tags`.`post_id` as `pivot_post_id` from `posts` inner join `post_tags` on `posts`.`id` = `post_tags`.`post_id` where `post_tags`.`tag_id` in (2, 4, 8)
select * from `posts` order by `created_at` asc limit 3
select `tags`.*, (select count(*) from `posts` inner join `post_tags` on `posts`.`id` = `post_tags`.`post_id` where `tags`.`id` = `post_tags`.`tag_id`) as `posts_count` from `tags` order by `posts_count` desc
---
    public function tagPosts (Request $request, Tag $tag)
    {

        $posts = Post::query()
                ->whereHas('tags', function ($query) use($tag){
                    $query->where('tag_id', $tag->id);
                })
                ->with('postCategory', 'user')
                ->orderBy('created_at')
                ->paginate(12)
                ;

        $postCategories = PostCategory::query()
                ->orderBy('priority')
                ->withCount(['posts'])
                ->get()
                ;

        $latestPosts = Post::query()
                ->orderBy('created_at')
                ->limit(3)
                ->get()
                ;


        $allTags = Tag::query()
                ->withCount('posts')
                ->orderBy('posts_count', 'desc')
                ->get()

select `tags`.*, (select count(*) from `posts` inner join `post_tags` on `posts`.`id` = `post_tags`.`post_id` where `tags`.`id` = `post_tags`.`tag_id`) as `posts_count` from `tags` where exists (select * from `posts` inner join `post_tags` on `posts`.`id` = `post_tags`.`post_id` where `tags`.`id` = `post_tags`.`tag_id` and `post_id` = 1) order by `posts_count` desc
select `post_categories`.*, (select count(*) from `posts` where `post_categories`.`id` = `posts`.`post_category_id`) as `posts_count` from `post_categories` order by `priority` asc
select * from `posts` order by `created_at` asc limit 3
select `tags`.*, (select count(*) from `posts` inner join `post_tags` on `posts`.`id` = `post_tags`.`post_id` where `tags`.`id` = `post_tags`.`tag_id`) as `posts_count` from `tags` order by `posts_count` desc
---
    public function singlePost (Request $request, Post $post)
    {

        $tags = Tag::query()
                ->whereHas('posts', function ($query) use($post) {
                    $query->where('post_id', $post->id);
                })
                ->with(['posts'])
                ->withCount('posts')
                ->orderBy('posts_count', 'desc')
                ->get()
                ;

        $postCategories = PostCategory::query()
                ->orderBy('priority')
                ->withCount(['posts'])
                ->get()
                ;

        $latestPosts = Post::query()
                ->orderBy('created_at')
                ->limit(3)
                ->get()
                ;


        $allTags = Tag::query()
                ->withCount('posts')
                ->orderBy('posts_count', 'desc')
                ->get()

update `posts` set `visits_number` = 11, `posts`.`updated_at` = '2020-04-08 11:21:07' where `id` = 2
---
    public function increseViews(Request $request, Post $post)
    {
        //dd($post);

        $numberOfViews = $post->visits_number;


        $post->visits_number = $numberOfViews + 1;


        $post->save();